cargo/src/__tests__/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60         # Test runs for 60 seconds
      arrivalRate: 5       # 5 new virtual users per second
      name: "Steady Load"
scenarios:
  - flow:
      - get:
          url: "/welcome"  

      - post:
          url: "/register"
          json:
            fname: "Test"
            lname: "User"
            username: "user_{{ $randomInt(1,1000000) }}"
            email: "testuser{{ $randomInt(1,1000000) }}@example.com"
            password: "password123"